---
kind: method
id: M:Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor
source: html/4271d7e2-a59e-2d5b-f285-22b3b7d2378d.htm
---
# Autodesk.Revit.DB.Lighting.AdvancedLossFactor.#ctor Method

Creates an advanced loss factor object with values set to no loss.

## Syntax (C#)
```csharp
public AdvancedLossFactor()
```